---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.RemoveBuildingStorey(Autodesk.Revit.DB.ElementId)
source: html/e1dada57-54f4-ecbb-d3bf-75144f65c34e.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.RemoveBuildingStorey Method

Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.

## Syntax (C#)
```csharp
public void RemoveBuildingStorey(
	ElementId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.ElementId`) - The level id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null